
&НаКлиенте
Процедура Инвентаризации(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаИнвентаризаций");
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПокупателей(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаИнтернетЗаказов");
КонецПроцедуры

&НаКлиенте
Процедура Сборки(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаСборкиДляПередачи");
КонецПроцедуры

&НаКлиенте
Процедура Маркировка(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ФормаСборкиТовара", Новый Структура("ТипДокумента", "Маркировка"));
	
КонецПроцедуры

&НаКлиенте
Процедура Приёмка(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ФормаПриёмкиТовара", Новый Структура("ТипДокумента", "Приёмка"));
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодКоличество(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаСозданияШтрихкодКоличество");
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияОТоваре(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаИнформацииОТоваре");
КонецПроцедуры
