
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Сборка = Параметры.Сборка;
	Индекс = Параметры.Индекс;
КонецПроцедуры

&НаСервере
Функция ОбновитьКартинку(ДвоичныеДанныеКартинка)
	СсылкаВХ=ПоместитьВоВременноеХранилище(ДвоичныеДанныеКартинка,Новый УникальныйИдентификатор);
	СсылкаНаКартинку = СсылкаВХ;
КонецФункции

&НаКлиенте
Процедура ОбновитьОписание(ТекстОписания)
	Элементы.Описание.Заголовок = ТекстОписания;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.СсылкаНаКартинку.РазмерКартинки = РазмерКартинки.Пропорционально;
	
	ЗаполнитьДанныеПоБраку();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПоБраку()
	
	ОбновитьКартинку(ПолучитьДвоичныеДанныеКартинки());
	ОбновитьОписание(ПолучитьТекстОписания());
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДвоичныеДанныеКартинки()
	
	Возврат Сборка.БракованыеТовары[Индекс].Фотография.Получить();
	
КонецФункции

&НаСервере
Функция ПолучитьТекстОписания()
	
	ТекСтрока = Сборка.БракованыеТовары[Индекс];
	
	Возврат ТекСтрока.Штрихкод + Символы.ПС + ТекСтрока.Описание + Символы.ПС + "Количество: " + ТекСтрока.Количество;
	
	
КонецФункции

&НаКлиенте
Процедура предБрак(Команда)
	СледующийБрак(-1);
КонецПроцедуры

&НаКлиенте
Процедура следБрак(Команда)
	СледующийБрак(1);
КонецПроцедуры

&НаКлиенте
Процедура СледующийБрак(Слогаемое)
	
	тИндекс = Индекс + Слогаемое;
	
	Если тИндекс < 0 ИЛИ тИндекс > ПолучитьКоличествоСтрокБрака()-1 Тогда
		ПоказатьПредупреждение(, "Это крайний элемент");
		Возврат;
	КонецЕсли;
	
	Индекс = тИндекс;
	ЗаполнитьДанныеПоБраку();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоСтрокБрака()
	
	Возврат Сборка.БракованыеТовары.Количество();
	
КонецФункции