
&НаКлиенте
Процедура СделатьСнимок(Команда)
	
	Если НЕ ПроверитьЗаполненностьРеквизитов() ТОгда
		Возврат;
	КонецЕсли;
	
	#Если МобильноеПриложениеКлиент Тогда
		Если СредстваМультимедиа.ПоддерживаетсяФотоснимок() Тогда
			
			Снимок	 = СредстваМультимедиа.СделатьФотоснимок(ТипКамерыУстройства.Задняя, ,100);
			
			Если Снимок = Неопределено Тогда
				ПоказатьПредупреждение(,"Снимок не сделан!");
				Возврат;
			КонецЕсли;
			
			ДДСнимок = Снимок.ПолучитьДвоичныеДанные();
			
			УправлениеСборками_Сервер.ВнестиДанныеПоБраку(Элементы.ДекорацияШтрихкод.Заголовок, Количество, Описание, ДДСнимок, Сборка, УникальныйИдентификатор);
			ЭтаФорма.Закрыть();
		КонецЕсли;
	#КонецЕсли
	

КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполненностьРеквизитов() 
	
	Результат = Истина;
	
	Если Количество = 0 И Штрихкод <> "<без ШК>" Тогда
		Сообщить("Заполните количество!");
		Результат = Ложь;
	КонецЕсли;
	
	Если СтрЗаменить(Описание, " ", "") = "" Тогда
		Сообщить("Заполните описание!");
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Сборка		 = Параметры.Сборка;
	Штрихкод	 = Параметры.Штрихкод;
	Количество	 = Параметры.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ДекорацияШтрихкод.Заголовок = Штрихкод;
КонецПроцедуры
