
&НаКлиенте
Процедура СоздатьИнвентаризацию(Команда)
	
	Если Не ВсеПоляЗаполнены() Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ФормаСборкиТовара", Новый Структура("ТипДокумента, Сборка", "Инвентаризация", СоздатьИнвентаризациюТовара()));
	
КонецПроцедуры

&НаСервере
Функция СоздатьИнвентаризациюТовара()
	Возврат УправлениеСборками_Сервер.СоздатьСборку_Инвентаризация(Название, ПолучитьГруппыТоваров()).Ссылка;
КонецФункции

&НаСервере
Функция ПолучитьГруппыТоваров()
	Возврат  ГруппыТовара.Выгрузить();
КонецФункции

&НаСервере
Функция ВсеПоляЗаполнены()
	
	Результат = Истина;
	
	Если Не ЗначениеЗаполнено(Название) Тогда
		Результат = Ложь;
		Сообщить("Не заполнено название");
	КонецЕсли;
	
	Если ГруппыТовара.Количество() = 0 Тогда
		Результат = Ложь;
		Сообщить("Не заполнены группы товара");
	КонецЕсли;
	
	Для Каждого Строчка Из ГруппыТовара Цикл
		Если Не ЗначениеЗаполнено(Строчка.Группа) Тогда
			Результат = Ложь;
			Сообщить("Не заполнена группа товара");
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
