
&НаКлиенте
Процедура ОбновитьССервера(Команда)
	ЗаполнитьДанныеПоЗаказам();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПоЗаказам()
	
	Результат = api.ПолучитьИнтернетЗаказыПокупателей();
	
	Если ТипЗнч(Результат) = Тип("Структура") и Результат.Свойство("Ошибка") Тогда
		ПоказатьПредупреждение(,Результат.Ошибка);
	Иначе
		
		Заказы.Очистить();
		МассивЗаказовВСборках = УправлениеСборками_Сервер.ПолучитьЗаказыВСборках();
		
		Для Каждого Элемент Из Результат Цикл
			
			Если МассивЗаказовВСборках.Найти(Элемент.idDoc) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Элемент.orderID) Тогда
				Продолжить;
			КонецЕсли;
			
			НС							 = Заказы.Добавить();
			НС.НомерЗаказа				 = Элемент.orderID;
			НС.ДатаОтгрузки				 = XMLЗначение(Тип("Дата"), Элемент.realizationDate);
			НС.СуммаДокумента			 = Элемент.summ;
			НС.ДокументСборка			 = Элемент.idDoc;
			
		КонецЦикла;
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьДанныеПоЗаказам();
КонецПроцедуры

&НаКлиенте
Процедура ОтветОбработатьЗаказ(Результат, ДопПараметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОткрытьФорму("ОбщаяФорма.ФормаСборкиТовара", Новый Структура("ТипДокумента,Сборка,_КонтрольМаркировки, _КонтрольФактическогоКоличества","ИнтернетЗаказ",СоздатьСборкуТипИнтернетЗаказ(ДопПараметры.Документ, ДопПараметры.Номер),Истина, Истина),,,,,Новый ОписаниеОповещения("ПослеЗакрытияФормыСборки", ЭтаФорма));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыСборки(Результат, ДопПараметры) Экспорт 
	Элементы.СборкиЗаказы.Обновить();
	ЗаполнитьДанныеПоЗаказам();
КонецПроцедуры

&НаСервере
Функция СоздатьСборкуТипИнтернетЗаказ(Заказ, Номер)
	
	Возврат УправлениеСборками_Сервер.СоздатьСборку_ИнтернетЗаказ("Заказ  " + Номер + " от " + Формат(ТекущаяДата(), "ДФ=dd.MM.yy"), Заказ).Ссылка;
	
КонецФункции

&НаКлиенте
Процедура ЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//Элемент.ДанныеСтроки(ВыбраннаяСтрока).Отметка = не Элемент.ДанныеСтроки(ВыбраннаяСтрока).Отметка;
	ПоказатьВопрос(Новый ОписаниеОповещения("ОтветОбработатьЗаказ", ЭтаФорма, Новый Структура("Документ, Номер", Элемент.ДанныеСтроки(ВыбраннаяСтрока).ДокументСборка, Элемент.ДанныеСтроки(ВыбраннаяСтрока).НомерЗаказа)), "Начать обработку заказа?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекущие(Команда)
	Элементы.СборкиЗаказы.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СборкиЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьФорму("ОбщаяФорма.ФормаСборкиТовара", Новый Структура("ТипДокумента,Сборка,_КонтрольМаркировки, _КонтрольФактическогоКоличества","ИнтернетЗаказ",Элемент.ДанныеСтроки(ВыбраннаяСтрока).Ссылка, Истина, Истина),,,,,Новый ОписаниеОповещения("ПослеЗакрытияФормыСборки", ЭтаФорма));
КонецПроцедуры
