
&НаКлиенте
Процедура УстановитьКомпоненту(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеУстановкуВнешнейКомпоненты", ЭтаФорма);

	НачатьУстановкуВнешнейКомпоненты(Оповещение, "ОбщийМакет.ДрайверСканераШтрихкодовAndroid");

КонецПроцедуры

&НаКлиенте
Процедура ПослеУстановкуВнешнейКомпоненты(ДопПараметры) Экспорт 
	
	НачатьПодключениеВнешнейКомпоненты(Новый ОписаниеОповещения("ПослеПодключенияВнешнейКомпоненты", ЭтаФорма), "ОбщийМакет.ДрайверСканераШтрихкодовAndroid", "com_ptolkachev_AndroidScannerExtension", ТипВнешнейКомпоненты.Native);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеПодключенияВнешнейКомпоненты(Результат, ДопПараметры) Экспорт 
	
	ProgID = "AddIn.com_ptolkachev_AndroidScannerExtension.com_ptolkachev_AndroidScannerExtension";
	глОбъектДрайвера = Новый(ProgID);
	
	//глОбъектДрайвера.УстановитьПараметр("ActionName", "com.xcheng.scanner.action.BARCODE_DECODING_BROADCAST");
	//глОбъектДрайвера.УстановитьПараметр("ExtraData", "EXTRA_BARCODE_DECODING_DATA");

	глОбъектДрайвера.УстановитьПараметр("ActionName", ПараметрыСканера.ActionName);
	глОбъектДрайвера.УстановитьПараметр("ExtraData", ПараметрыСканера.ExtraData);

КонецПроцедуры

&НаКлиенте
Процедура ПодключитьКомпоненту(Команда)
	глОбъектДрайвера.Подключить("");
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьУстройствоЗавершение(РезультатВыполнения, ПараметрыВызова, КонтекстПодключения) Экспорт
	//ПоказатьПредупреждение(,"Подключение " + РезультатВыполнения);
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьКомпоненту(Команда)
	глОбъектДрайвера.Отключить("");
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	ПоказатьИнформацию(Источник, Событие, Данные);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоказатьИнформацию(Источник, Событие, Данные)
	Сообщить("Источник - " + Источник); //"com_ptolkachev_AndroidScanner"
	Сообщить("Событие - " + Событие); //"Штрихкод"
	Сообщить("Данные - " + Данные); //Штрихкод
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	ПараметрыСканера = ОбщегоНазначения_Сервер.ДеСериализовать(Константы.ПараметрыСканераШтрихкодовAndroid.Получить());
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
