
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокТекущихТранзитов()
	
	Результат = api.ПолучитьПоступленияНаТранзитах();
	
	Если ТипЗнч(Результат) = Тип("Структура") и Результат.Свойство("Ошибка") Тогда
		ПоказатьПредупреждение(,Результат.Ошибка);
	Иначе
		
		ТранзитныеДокументы.Очистить();
		МассивПТУВСборках = УправлениеСборками_Сервер.ПолучитьПТУВСборках();
		
		Для Каждого Элемент Из Результат Цикл
			
			Если МассивПТУВСборках.Найти(Элемент.idDoc) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НС							 = ТранзитныеДокументы.Добавить();
			НС.Контрагент				 = Элемент.supplier;
			НС.Номер					 = Элемент.numberDoc;
			НС.КонтрагентКод			 = Элемент.supplierCode;
			НС.Дата						 = XMLЗначение(Тип("Дата"), Элемент.dateDoc); //Какого-то чёрта не парсится сразу
			НС.ИдентификаторДокумента	 = Элемент.idDoc;
			НС.Сумма					 = Элемент.summ;
			НС.Контейнер				 = Элемент.container;
			
		КонецЦикла;
		
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолучитьСписокТекущихТранзитов();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ПолучитьСписокТекущихТранзитов();
КонецПроцедуры

&НаКлиенте
Процедура ТранзитныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Элемент.ДанныеСтроки(ВыбраннаяСтрока).Отметка = не Элемент.ДанныеСтроки(ВыбраннаяСтрока).Отметка;
КонецПроцедуры

&НаКлиенте
Функция  ПолучитьМассивДокументовНаПриёмку()
	
	МассивДоков = Новый Массив;
	
	Для Каждого Строчка Из ТранзитныеДокументы Цикл
		
		Если Строчка.Отметка тогда
			МассивДоков.Добавить(Строчка.ИдентификаторДокумента);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивДоков;
	
КонецФункции

&НаСервере
Функция  ПолучитьСписокВыбранныхКонтрагентов()
	
	СтрокаКонтрагентов = "";
	МассивКонтрагентов = Новый Массив;
	
	Для Каждого Строчка Из ТранзитныеДокументы Цикл
		
		Если Строчка.Отметка И МассивКонтрагентов.Найти(Строчка.Контрагент) = Неопределено тогда
			СтрокаКонтрагентов = СтрокаКонтрагентов + Строчка.Контрагент + " ";
			МассивКонтрагентов.Добавить(Строчка.Контрагент);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрокаКонтрагентов;
	
КонецФункции

&НаКлиенте
Процедура НачатьПриёмку(Команда)
	
	МассивТранзитов = ПолучитьМассивДокументовНаПриёмку();
	
	Если МассивТранзитов.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не выбрано ни  одного документа");
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ФормаСборкиТовара", Новый Структура("ТипДокумента,Сборка,_КонтрольМаркировки","Приёмка",СоздатьСборкуТипПриёмка(МассивТранзитов),Ложь),,,,,Новый ОписаниеОповещения("ПослеЗакрытияФормыСборки", ЭтаФорма));
	
КонецПроцедуры

&НаСервере
Функция СоздатьСборкуТипПриёмка(МассивТранзитов)
	
	Возврат УправлениеСборками_Сервер.СоздатьСборку_Приёмка("Приёмка  " + ПолучитьСписокВыбранныхКонтрагентов() + " от " + Формат(ТекущаяДата(), "ДФ=dd.MM.yy"), МассивТранзитов).Ссылка;
	
КонецФункции

&НаКлиенте
Процедура ДокументыПриёмкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьФорму("ОбщаяФорма.ФормаСборкиТовара", Новый Структура("ТипДокумента,Сборка,_КонтрольМаркировки","Приёмка",Элемент.ДанныеСтроки(ВыбраннаяСтрока).Ссылка,Ложь),,,,,Новый ОписаниеОповещения("ПослеЗакрытияФормыСборки", ЭтаФорма));
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДокументыПриёмки(Команда)
	Элементы.ДокументыПриёмки.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыСборки(Результат, ДопПараметры) Экспорт 
	ПолучитьСписокТекущихТранзитов();
	Элементы.ДокументыПриёмки.Обновить();
КонецПроцедуры