
&НаКлиенте
Процедура Обновить_ВРаботе(Команда)
	Элементы.Сборки_ВРаботе.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура Обновить_Центр(Команда)
	ЗаполнитьДанныеПоСборкамССервера();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьДанныеПоСборкамССервера();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПоСборкамССервера()
	
	Результат = api.ПолучитьСборкиТовара();
	
	Если ТипЗнч(Результат) = Тип("Структура") и Результат.Свойство("Ошибка") Тогда
		ПоказатьПредупреждение(,Результат.Ошибка);
	Иначе
		
		Сборки_Центр.Очистить();
		МассивНачатыхСборок = УправлениеСборками_Сервер.ПолучитьСборкиВРаботе();
		
		Для Каждого Элемент Из Результат Цикл
			
			Если МассивНачатыхСборок.Найти(Элемент.idDoc) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
						
			НС							 = Сборки_Центр.Добавить();
			НС.Получатель				 = Элемент.shopRecipient;
			НС.Номер					 = Элемент.number;
			НС.Документ					 = Элемент.idDoc;
			НС.ВидСборки				 = Элемент.kindAssembly;
			НС.Дата						 = XMLЗначение(Тип("Дата"), Элемент.date);
			
		КонецЦикла;
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция  СоздатьСборку(Документ, Номер)
	Возврат УправлениеСборками_Сервер.СоздатьСборку_СборкаТовара("Сборка " + Номер, Документ).Ссылка;
КонецФункции

&НаКлиенте
Процедура ОтветОбработатьСборку(Результат, ДопПараметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОткрытьФорму("ОбщаяФорма.ФормаСборкиТовара", Новый Структура("ТипДокумента,Сборка,_КонтрольМаркировки, _КонтрольФактическогоКоличества","Сборка",СоздатьСборку(ДопПараметры.Документ, ДопПараметры.Номер),Истина, Истина),,,,,Новый ОписаниеОповещения("ПослеЗакрытияФормыСборки", ЭтаФорма));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сборки_ЦентрВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьВопрос(Новый ОписаниеОповещения("ОтветОбработатьСборку", ЭтаФорма, Новый Структура("Документ, Номер", Элемент.ДанныеСтроки(ВыбраннаяСтрока).Документ, Элемент.ДанныеСтроки(ВыбраннаяСтрока).Номер)), "Начать сборку?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура Сборки_ВРаботеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьФорму("ОбщаяФорма.ФормаСборкиТовара", Новый Структура("ТипДокумента,Сборка,_КонтрольМаркировки, _КонтрольФактическогоКоличества","Сборка",Элемент.ДанныеСтроки(ВыбраннаяСтрока).Ссылка, Истина, Истина),,,,,Новый ОписаниеОповещения("ПослеЗакрытияФормыСборки", ЭтаФорма));
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыСборки(Результат, ДопПараметры) Экспорт 
	ЗаполнитьДанныеПоСборкамССервера();
	Элементы.Сборки_ВРаботе.Обновить();
КонецПроцедуры