
&НаКлиенте
Процедура ДанныеСверкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьФорму("ОбщаяФорма.ФормаСверкиДетальная", Новый Структура("Товар, Сборка, Штрихкод, МаркированныеТовары",  Элемент.ДанныеСтроки(ВыбраннаяСтрока).Название, Сборка, Элемент.ДанныеСтроки(ВыбраннаяСтрока).Штрихкод, ПолучитьМассивМаркированныхТоваров()));
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивМаркированныхТоваров()
	Возврат МаркированныеТовары.Выгрузить().ВыгрузитьКолонку("Идентификатор");
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Сборка = Параметры.Сборка;
	
	Для Каждого ИД Из Параметры.МаркированныеТовары Цикл
		НС = МаркированныеТовары.Добавить();
		НС.Идентификатор = ИД;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьДанныеПоСверке();
	
КонецПроцедуры

&Насервере 
Процедура ЗаполнитьДанныеПоСверке()
	
	ДанныеСверки.Очистить();
	
	ТЗУточнить = УправлениеСборками_Сервер.ПолучитьСписокТоваровДляУточнения(Сборка);
	
	Для Каждого Строчка Из ТЗУточнить Цикл
		НС = ДанныеСверки.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Строчка);
		НС.Штрихкоды = ОбщегоНазначения_Сервер.ПолучитьСтроковоеПредставлениеМассива(ОбщегоНазначения_Сервер.ДеСериализовать(Строчка.Штрихкоды));
		НС.Комментарий = УправлениеСборками_Сервер.НормироватьКомментарий(Строчка.Комментарий);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьДанныеПоСверке();
КонецПроцедуры
