
&НаКлиенте
Процедура ЗаполнитьМагазины(Команда)
	
	Результат = api.ПолучитьМагазины();
	
	Если ТипЗнч(Результат) = Тип("Структура") и Результат.Свойство("Ошибка") Тогда
		ПоказатьПредупреждение(,Результат.Ошибка);
	Иначе
		ОбщегоНазначения_Сервер.ОбновитьСправочникМагазины(Результат);
		ПоказатьОповещениеПользователя("Справочник магазины загружен");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНоменклатурныеГруппы(Команда)
	
	Результат = api.ПолучитьТоварныеГруппы();
	
	Если ТипЗнч(Результат) = Тип("Структура") и Результат.Свойство("Ошибка") Тогда
		ПоказатьПредупреждение(,Результат.Ошибка);
	Иначе
		ОбщегоНазначения_Сервер.ОбновитьСправочникГруппаТоваров(Результат);;
		ПоказатьОповещениеПользователя("Справочник Группы товаров загружен");
	КонецЕсли;
КонецПроцедуры
