
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСборкиИнвентаризации();
КонецПроцедуры

&НаКлиенте
Процедура Обновить_Центр(Команда)
	ЗаполнитьСборкиИнвентаризации();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСборкиИнвентаризации()
	
	Результат = api.ПолучитьАктуальныеИнвентаризации();
	
	Если ТипЗнч(Результат) = Тип("Структура") и Результат.Свойство("Ошибка") Тогда
		ПоказатьПредупреждение(,Результат.Ошибка);
	Иначе
		
		Инвентаризации_Центр.Очистить();
		МассивИнвентаризацийВСборках = УправлениеСборками_Сервер.ПолучитьИнвентаризацииВСборках();
		
		Для Каждого Элемент Из Результат Цикл
			
			Если МассивИнвентаризацийВСборках.Найти(Элемент.idDoc) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НС					 = Инвентаризации_Центр.Добавить();
			НС.Номер			 = Элемент.number;
			НС.Дата				 = XMLЗначение(Тип("Дата"), Элемент.date);
			НС.Комментарий		 = Элемент.comment;
			НС.Документ			 = Элемент.idDoc;
			
		КонецЦикла;
				
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Обновить_Текущие(Команда)
	Элементы.Инвентаризации_Текущие.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура Инвентаризации_ЦентрВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьВопрос(Новый ОписаниеОповещения("Ответ_СоздатьСборку", ЭтаФорма, Новый Структура("Документ, Номер", Элемент.ДанныеСтроки(ВыбраннаяСтрока).Документ, Элемент.ДанныеСтроки(ВыбраннаяСтрока).Номер)), "Начать Инвентаризацию?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура Ответ_СоздатьСборку(Результат, ДопПараметры) экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ФормаСборкиТовара", Новый Структура("ТипДокумента, Сборка", "Инвентаризация", СоздатьИнвентаризациюТовара(ДопПараметры.Документ, "Инвентаризация " + ДопПараметры.Номер + " от " + Формат(ТекущаяДата(), "ДФ=dd.MM.yy"))),,,,,Новый ОписаниеОповещения("ПослеЗакрытияФормыСборки", ЭтаФорма));
	
КонецПроцедуры

&НаСервере
Функция СоздатьИнвентаризациюТовара(Документ, Название)
	Возврат УправлениеСборками_Сервер.СоздатьСборку_Инвентаризация(Название,,Документ).Ссылка;
КонецФункции


&НаКлиенте
Процедура Инвентаризации_ТекущиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьФорму("ОбщаяФорма.ФормаСборкиТовара", Новый Структура("ТипДокумента, Сборка", "Инвентаризация", Элемент.ДанныеСтроки(ВыбраннаяСтрока).Ссылка),,,,,Новый ОписаниеОповещения("ПослеЗакрытияФормыСборки", ЭтаФорма));
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИнвентаризацию(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаСозданияИнвентаризации");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	ПоказатьПредупреждение(, "Активизация");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПерехода(ОбъектПерехода, СтандартнаяОбработка)
	ПоказатьПредупреждение(, "Переход");
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыСборки(Результат, ДопПараметры) Экспорт 
	ЗаполнитьСборкиИнвентаризации();
	Элементы.Инвентаризации_Текущие.Обновить();
КонецПроцедуры