
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиСборки = Константы.НастройкиСборки.Получить();
	
	Если НастройкиСборки = "" Тогда
		Константы.НастройкиСборки.Установить(ОбщегоНазначения_Сервер.Сериализовать(Новый Структура("АвтовводЕдиницы", Ложь)));
	КонецЕсли;
	
	ПараметрыСканера = Константы.ПараметрыСканераШтрихкодовAndroid.Получить();
	
	Если ПараметрыСканера = "" Тогда
		Константы.ПараметрыСканераШтрихкодовAndroid.Установить(ОбщегоНазначения_Сервер.Сериализовать(Новый Структура("ActionName,ExtraData","com.xcheng.scanner.action.BARCODE_DECODING_BROADCAST","EXTRA_BARCODE_DECODING_DATA")));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаНастроекОбщая");
КонецПроцедуры

&НаКлиенте
Процедура НачальноеЗаполнение(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаНачальноеЗаполнениеБазы");
КонецПроцедуры

&НаКлиенте
Процедура НачалоРаботы(Команда)
	ОткрытьФорму("ОбщаяФорма.ОбщаяФормаДействий");
КонецПроцедуры

&НаКлиенте
Процедура КомандаФормаМаркировки(Команда)
	МассивМаркировки = Новый Массив;
	МассивМаркировки.Добавить(1);
	МассивМаркировки.Добавить(1);
	МассивМаркировки.Добавить(1);
	МассивМаркировки.Добавить(1);
	ОткрытьФорму("ОбщаяФорма.ФормаВводаМаркировки", Новый Структура("ДоступнаяМаркировка", МассивМаркировки));
КонецПроцедуры

&НаКлиенте
Процедура ОПрограмме(Команда)
	ПоказатьПредупреждение(, "Версия " + лВерсия);
КонецПроцедуры
