
&НаКлиенте
Процедура СоздатьДокумент(Команда)
	
	Если Не ЗначениеЗаполнено(Название) Тогда
		ПоказатьПредупреждение(, "Не заполнено название");
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ФормаСборкиТовара", Новый Структура("ТипДокумента, Сборка", "ШтрихкодКоличество", СоздатьСборкуШтрихкодКоличество()));
	
КонецПроцедуры

&НаКлиенте
Процедура Сборки_ТекущиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьФорму("ОбщаяФорма.ФормаСборкиТовара", Новый Структура("ТипДокумента, Сборка", "ШтрихкодКоличество", Элемент.ДанныеСтроки(ВыбраннаяСтрока).Ссылка));
КонецПроцедуры

&НаСервере
Функция СоздатьСборкуШтрихкодКоличество()
	Возврат УправлениеСборками_Сервер.СоздатьСборку_ШтрихкодКоличество(Название + " ").Ссылка;
КонецФункции

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.Сборки_Текущие.Обновить();
КонецПроцедуры
